[
  {
    "error": "Neuroendoscopic transnasosphenoidal approach to pituitary adenoma resection + sellar floor reconstruction",
    "surgery_review": "After the anesthesia takes effect, the patient lies in a supine position with the head slightly tilted back, and the operating table is positioned with the head high and the feet low.\n The surgical field is sterilized and draped as usual.\n The nasal cavity and lips are disinfected with complex iodine, and the nasal cavity and lips are disinfected with norepinephrine.\n Five minutes after shrinking the middle turbinate with a 1ml cotton pad, perform neuroendoscopic exploration first.\n Remove part of the right middle turbinate.\n Use monopolar electrosurgery to incise the nasal mucosa from the opening of the sphenoid sinus to the choanal space to reveal the bony nasal septum.\n Drill and polish the bony nasal septum at high speed.\n Open the ventral wall of the sphenoid sinus and enlarge the bone window to 1.5cm.\n Use a microdrill to expand the sellar floor bone window to 1.3cm.\n Confirm the absence of a false capsule, intact sellar septum, and complete resection of the tumor.\n Collect tissue with forceps and use various types of curettes to carefully curette the tumor cavity in the sella.\n Flush the tumor cavity with normal saline.\n Perform a careful inspection to check for any leakage of cerebrospinal fluid.\n Reconstruct the sellar floor using artificial dura mater.\n Pack the nasal cavity with Naxi cotton and cover with sterile dressing.\n The operation took 2 hours and the blood loss was about 100ml.\n The endotracheal tube was placed back in the anesthesia recovery room.\n The tumor was approximately 18×12×14mm3 and was sent for pathological examination.Shortcomings of this operation and suggestions:1. Lack of detailed documentation: The surgical report lacks specific details about the steps performed, such as the specific instruments used, the duration of each step, and any complications encountered. It is important to provide a more comprehensive and detailed account of the surgery for future reference and analysis.2. Inconsistent formatting: The surgical report does not follow a consistent format, making it difficult to read and understand. It is important to organize the report in a clear and structured manner, using headings and subheadings to separate different sections of the surgery.3. Inadequate documentation of vital signs: The report does not mention the patient's vital signs during the surgery, such as heart rate, blood pressure, and oxygen saturation levels. It is crucial to document and monitor these vital signs throughout the surgery to ensure the patient's safety and wellbeing.4. Lack of postoperative care documentation: The report does not mention any postoperative care measures taken, such as pain management, wound care, or followup plans. It is important to document the postoperative care provided to the patient for continuity of care and future reference.5. Absence of a postoperative assessment: The report does not include an assessment of the patient's condition after the surgery, such as their level of consciousness, neurological status, or any immediate postoperative complications. It is essential to document the patient's postoperative status to evaluate the success of the surgery and identify any potential issues.6. Incomplete documentation of blood loss: The report mentions a blood loss of approximately 100ml, but does not provide any information on how this was managed or if any blood transfusion was required. It is important to document the management of blood loss during surgery, including any transfusions or other interventions.7. Lack of discussion on surgical outcomes: The report does not discuss the expected outcomes of the surgery or any potential risks or complications associated with the procedure. It is important to provide a comprehensive discussion on the expected outcomes and potential risks to ensure informed decisionmaking and patient understanding.Overall, the surgical report needs improvement in terms of documentation, formatting, and inclusion of important details. It is crucial to provide a comprehensive and accurate account of the surgery to ensure patient safety, continuity of care, and future reference.",
    "surgery_name": "Neuroendoscopic, neuronavigated expanded transsphenoidal approach for pituitary adenoma resection + sellar floor reconstruction",
    "id": "1",
    "tag":0,
    "MR": "Postoperative pituitary tumor changes, the sphenoid sinus mucosa is thickened. The right side of the pituitary gland is full, with patchy slightly higher T2 and isoT1 signals, mild enhancement, and relatively slightly low signal, 1.8×1.2×1.4 cm, the right cavernous sinus was surrounded and the left pituitary gland was evenly enhanced. The transverse diameter was 2.6 mm and the anteroposterior diameter was 2.1 mm. There was no obvious abnormality in the left cavernous sinus. There is short T1 signal in the lobe. Local mucosal thickening in the sphenoid sinus and ethmoid sinus. Compare with the old film from our hospital on 20210803: the changes after transsphenoidal surgery of the pituitary gland are still visible, and the right side of the pituitary gland is slightly larger than before. Please combine it. Clinical followup review showed that the local mucosa of the sphenoid sinus and ethmoid sinus was thickened, which was better than before; the rest was basically the same as before. ",
    "standard_Preoperative diagnosis": "Silent recurrent aggressive pituitary ACTH macroadenoma",
    "standard_Surgical steps": "After the anesthesia takes effect, the patient lies in a supine position with the head slightly tilted back, and the operating table is positioned with the head high and the feet low. The surgical field is sterilized and draped as usual, and the nasal cavity and lips are disinfected with complex iodine, and the nasal cavity and lips are disinfected with norepinephrine. Five minutes after shrinking the middle turbinate with a 1ml cotton pad, perform neuroendoscopic exploration first, remove part of the right middle turbinate, and use monopolar electrosurgery to incise the nasal mucosa from the opening of the sphenoid sinus to the choanal space to reveal the bony nasal septum, which is then drilled and polished at high speed. The ventral wall of the sphenoid sinus is opened, and the bone window is enlarged to 1.5cm A microdrill was used to expand the sellar floor bone window to 1.3cm There is no false capsule, the medial wall of the right cavernous sinus is defective, the sellar septum is intact, and the tumor is completely resected. After the tissue is collected with forceps, various types of curettes are used to carefully curette the tumor cavity in the sella and flush the tumor cavity with normal saline. No residual tumor tissue was found. Careful inspection showed no leakage of cerebrospinal fluid. Artificial dura mater was used to reconstruct the sellar floor. The nasal cavity was packed with Naxi cotton and covered with sterile dressing. The operation took 2 hours and the blood loss was about 100ml. The endotracheal tube was placed back in the anesthesia recovery room. The tumor was approximately 18×12×14mm3 and was sent for pathological examination. "
  },
  {
    "error": "Neuroendoscopic transnasosphenoidal approach to pituitary adenoma resection + sellar floor reconstruction",
    "surgery_review": "  The patient was placed in a supine position with the head slightly tilted back, and the operating table was positioned with the head high and the feet low.\n The surgical field was sterilized and draped as usual.\n The nasal cavity and lips were disinfected with iodinecontaining cotton swabs.\n Epinephrine 1ml cotton pads were used to shrink the middle turbinate.\n Neuroendoscopic exploration was performed to expose the ventral wall of the sphenoid sinus.\n The sphenoid sinus opening was expanded with a microburr, and the ventral wall of the sphenoid sinus was removed.\n The bone window of the sellar floor was opened by microdrilling to 1.5cm.\n Pathological specimens were obtained with forceps.\n The contents of the cyst were removed sequentially with a microscopic curette.\n The cyst was mainly located in the sella, and thinned normal anterior pituitary tissue was seen in the sella.\n No residual cyst content was found during the endoscopic examination.\n There was no obvious cerebrospinal fluid leakage in the sella, no obvious active bleeding in the surgical field, and no foreign body residue.\n The lesion cavity was filled with artificial dura mater, and the sellar floor was reconstructed with instant gauze.\n One piece of Naxi cotton was filled on the left and right sides of the nasal cavity.\n The operation was completed with little bleeding and no blood transfusion required.\n After the operation, the patient's breathing recovered and the patient was returned to the anesthesia recovery room with endotracheal intubation.\n The cyst was removed and the specimen was sent to the pathology department.Shortcomings of this operation compared to the standard surgical procedure:1. Lack of detailed information on the positioning of the patient and the use of a head frame for neuronavigation registration.\n2. No mention of the use of scalp clips to stop bleeding during the incision of the scalp.\n3. No mention of the use of intraoperative ultrasound and neuronavigation for precise tumor localization.\n4. No mention of electrophysiological monitoring to identify functional areas and avoid damage during tumor resection.\n5. No mention of intraoperative MRI to assess the extent of tumor resection.\n6. No mention of flushing the surgical field and placing a drainage tube.\n7. No mention of suturing the dural resection edge and covering it with artificial dura mater.\n8. No mention of the use of a titanium alloy nail plate for free bone plate reduction.\n9. No mention of the amount of bleeding during the operation and the need for hemostatic measures.\n10. No mention of the closure of the galea aponeurosis and scalp suturing.Suggestions for improvement:1. Ensure proper patient positioning and use a head frame for neuronavigation registration.\n2. Use scalp clips to stop bleeding during the incision of the scalp.\n3. Utilize intraoperative ultrasound and neuronavigation for precise tumor localization.\n4. Perform electrophysiological monitoring to identify functional areas and avoid damage during tumor resection.\n5. Use intraoperative MRI to assess the extent of tumor resection.\n6. Flush the surgical field and place a drainage tube.\n7. Suture the dural resection edge and cover it with artificial dura mater.\n8. Consider using a titanium alloy nail plate for free bone plate reduction.\n9. Monitor and manage bleeding during the operation, and document the amount of blood loss.\n10. Ensure proper closure of the galea aponeurosis and scalp suturing.Overall, the surgical report provided lacks some important details and adherence to the standard surgical procedure. Improvement in documentation and following the standard surgical process is recommended for future surgeries.",
    "surgery_name": "Neuroendoscopic transnasal sphenoidal sinus sellar region spaceoccupying lesion resection + sellar floor reconstruction",
    "id": "2",
    "tag":0,
    "MR": "The sellar area is enlarged. The transverse diameter of the pituitary gland is 17.6mm, the height is 11.4mm, and the anteroposterior diameter is 11.2mm. There is a roundshaped T1 slightly high signal and T2 low signal nodule in the posterior part of the pituitary gland, measuring about 8.2×8.9×15.8mm. , the enhanced scan showed no clear enhancement, and the remaining pituitary glands were moderately enhanced. The transverse diameter of the pituitary stalk was 1.8 mm, and the anteroposterior diameter was 2.6 mm. There was no pressure shift of the optic chiasm and no obvious abnormality of the posterior pituitary gland on both sides. T1 signal is unclear. Bilateral maxillary sinus mucosa is thickened. Abnormal signal in the posterior pituitary gland, Rathke's cleft cyst is possible; short T1 signal in the posterior pituitary gland is unclear, please consider clinical practice; bilateral maxillary sinus mucosa is thickened. ",
    "standard_Preoperative diagnosis": "cystic spaceoccupying lesion in the sellar region",
    "standard_Surgical steps": "After the anesthesia takes effect, the patient lies in a supine position with the head slightly tilted back, and the operating table is positioned with the head high and the feet low. The surgical field is sterilized and draped as usual, and the nasal cavity and lips are disinfected with iodinecontaining cotton swabs. Five minutes after epinephrine 1ml cotton pads were used to shrink the middle turbinate, neuroendoscopic exploration was performed first to expose the ventral wall of the sphenoid sinus. The sphenoid sinus opening was expanded with a microburr, and the ventral wall of the sphenoid sinus was removed. The thinning of the sellar floor bone was seen. The bone window of the sellar floor is opened by microdrilling to 1.5cm After the pathological specimens were obtained with forceps, the contents of the cyst were removed sequentially with a microscopic curette. The cyst was mainly located in the sella. The thinned normal anterior pituitary tissue was seen in the sella. No residual cyst content was found during the endoscopic examination. There was no obvious cerebrospinal fluid leakage in the sella, no obvious active bleeding in the surgical field, and no foreign body residue. The lesion cavity was filled with artificial dura mater, and the sellar floor was reconstructed with instant gauze. One piece of Naxi cotton was filled on the left and right sides of the nasal cavity. The operation was completed. There was little bleeding during the operation and no blood transfusion was performed. After the operation, the patient's breathing recovered and the patient was returned to the anesthesia recovery room with endotracheal intubation. The cyst was removed and the specimen was sent to the pathology department. "
  }

]