[
    {
      "error": "Neuroendoscopic Transnasosphenoidal Approach to Pituitary Adenoma Resection + Sellar Floor Reconstruction",
      "surgery_review": "Surgery Process:\n\nAfter the anesthesia is completed, the patient is placed in the left lateral decubitus position, placed on a head frame, and fixed. Neuronavigation registration was used to outline the projection of the tumor on the body surface, and a right temporo-parieto-occipital horseshoe incision was designed based on this. The surgical field is sterilized and draped as usual; the scalp, subcutaneous, and galeal aponeurosis are incised in sequence, and scalp clips are used to stop bleeding; the skin flap is separated under the galea aponeurosis and turned downward, and the milling cutter is used to cut the bone plate after drilling. At this time, the meningeal tension is slightly higher, and dural suspension is performed. After intraoperative ultrasound and neuronavigation, the dura mater was incised radially. Electrophysiological monitoring confirmed that there was a cortical fistula in the non-functional area of ​​the temporoparietal area. Under the guidance of navigation and ultrasound, dark red tumor tissue was visible about 2cm deep. The rapid freezing pathology may indicate that it is a high-grade glioma. According to the rough boundary of the tumor, the suction device, bipolar electrocoagulation, and scissors are used to separate bluntly and sharply, and gradually go deep into the blood vessels. Red, soft and uneven texture, rich blood supply, the size of the resected lesion is about 5cm×6cm×6cm. The triangular area of ​​the lateral ventricle is open. Electrophysiological monitoring showed that the anterior tumor invaded the posterior limb of the internal capsule, so it was not resected. After the tumor was basically removed under the microscope, intraoperative MRI was performed, which showed subtotal resection of the lesion. The peripheral wall of the residual cavity was carefully stopped with bipolar electrocoagulation, and covered with gelatin sponge, collagen surgical hemostatic material, and instant gauze to further enhance the hemostatic effect. The systolic blood pressure increased to the entrance blood pressure. It was confirmed that the hemostasis was satisfactory, the brain pulse was good, and there was no After the foreign body remains, the ventricle and the surgical field are flushed and a drainage tube is placed. The dural resection edge is sutured intermittently and covered with artificial dura mater to keep the dura mater intact. Titanium alloy nail plate is used for free bone plate reduction. The galea aponeurosis was sutured intermittently and tightly; the scalp was sutured in sequence, covered with sterile dressing, and returned to the ward safely. The bleeding during the operation was about 100ml, no blood transfusion was performed, and the specimen was sent for pathological examination.\n\nShortcomings and Suggestions:\n\n1. **Intraoperative Monitoring**: The report mentions the use of electrophysiological monitoring, but it does not specify the type of monitoring used or the parameters measured. It would be beneficial to include details about the monitoring techniques employed and how they contributed to the surgical outcome.\n\n2. **Extent of Tumor Resection**: The report states that the tumor was subtotally resected, but it does not provide information on the percentage of the tumor that was removed. Providing this information would give a clearer picture of the surgical success.\n\n3. **Postoperative Care**: The report briefly mentions the patient's return to the ward, but it does not detail the postoperative care plan or any potential complications. Including this information would provide a more comprehensive view of the patient's recovery process.\n\n4. **Pathology Report**: The report mentions that the specimen was sent for pathological examination, but it does not provide any details about the pathology findings. Including this information would be important for assessing the completeness of the tumor resection and the patient's prognosis.\n\n5. **Surgical Time and Blood Loss**: The report provides the total surgical time and estimated blood loss, but it does not break down these figures by procedure or phase of the surgery. Providing this information would give a better understanding of the surgical efficiency and the extent of the patient's blood loss.\n\n6. **Surgical Technique**: The report could benefit from a more detailed description of the surgical technique used, including the specific instruments and methods employed. This would help assess the surgical skill and the appropriateness of the chosen technique.\n\n7. **Patient Selection**: The report does not discuss the patient's selection for this particular surgical approach. Including information about the patient's medical history, comorbidities, and the rationale for choosing this surgical approach would provide context for the surgical decision-making process.\n\n8. **Surgical Complications**: The report does not mention any surgical complications. Including information about any complications that occurred, their management, and their impact on the patient's outcome would provide a more complete picture of the surgical experience.\n\n9. **Follow-up**: The report does not discuss any follow-up care or surveillance for recurrence. Including information about the patient's postoperative course, any adjuvant therapy, and plans for long-term follow-up would be important for assessing the overall success of the surgical intervention.\n\n10. **Quality Improvement**: The report could benefit from a discussion of how the surgical team plans to improve their practice based on this experience. This could include reflection on the surgical technique, the use of technology, or the patient selection process.\n\nBy addressing these points, the surgical report could provide a more comprehensive and informative account of the surgical procedure, its outcomes, and the lessons learned from the experience. This would not only benefit the patient but also contribute to the advancement of surgical practice and patient care.",
      "surgery_name": "Neuroendoscopic, neuronavigated expanded transsphenoidal approach for pituitary adenoma resection + sellar floor reconstruction",
      "id": "1",
      "tag":0,
      "MR": "Postoperative pituitary tumor changes, the sphenoid sinus mucosa is thickened. The right side of the pituitary gland is full, with patchy slightly higher T2 and iso-T1 signals, mild enhancement, and relatively slightly low signal, 1.8×1.2×1.4 cm, the right cavernous sinus was surrounded and the left pituitary gland was evenly enhanced. The transverse diameter was 2.6 mm and the anteroposterior diameter was 2.1 mm. There was no obvious abnormality in the left cavernous sinus. There is short T1 signal in the lobe. Local mucosal thickening in the sphenoid sinus and ethmoid sinus. Compare with the old film from our hospital on 2021-08-03: the changes after transsphenoidal surgery of the pituitary gland are still visible, and the right side of the pituitary gland is slightly larger than before. Please combine it. Clinical follow-up review showed that the local mucosa of the sphenoid sinus and ethmoid sinus was thickened, which was better than before; the rest was basically the same as before. ",
      "standard_Preoperative diagnosis": "Silent recurrent aggressive pituitary ACTH macroadenoma",
      "standard_Surgical steps": "After the anesthesia takes effect, the patient lies in a supine position with the head slightly tilted back, and the operating table is positioned with the head high and the feet low. The surgical field is sterilized and draped as usual, and the nasal cavity and lips are disinfected with complex iodine, and the nasal cavity and lips are disinfected with norepinephrine. Five minutes after shrinking the middle turbinate with a 1ml cotton pad, perform neuroendoscopic exploration first, remove part of the right middle turbinate, and use monopolar electrosurgery to incise the nasal mucosa from the opening of the sphenoid sinus to the choanal space to reveal the bony nasal septum, which is then drilled and polished at high speed. The ventral wall of the sphenoid sinus is opened, and the bone window is enlarged to 1.5cm A micro-drill was used to expand the sellar floor bone window to 1.3cm There is no false capsule, the medial wall of the right cavernous sinus is defective, the sellar septum is intact, and the tumor is completely resected. After the tissue is collected with forceps, various types of curettes are used to carefully curette the tumor cavity in the sella and flush the tumor cavity with normal saline. No residual tumor tissue was found. Careful inspection showed no leakage of cerebrospinal fluid. Artificial dura mater was used to reconstruct the sellar floor. The nasal cavity was packed with Naxi cotton and covered with sterile dressing. The operation took 2 hours and the blood loss was about 100ml. The endotracheal tube was placed back in the anesthesia recovery room. The tumor was approximately 18×12×14mm3 and was sent for pathological examination. "
    },
    {
      "error": "Neuroendoscopic Transnasosphenoidal Approach to Pituitary Adenoma Resection + Sellar Floor Reconstruction",
      "surgery_review": "Surgery Process:\n\n1. **Preoperative Preparation**: The patient was properly prepared for surgery, including the administration of preoperative medications and the placement of monitoring devices. The surgical team was assembled and ready to proceed.\n\n2. **Anesthesia Administration**: The anesthesia was administered effectively, ensuring the patient was adequately sedated and pain-free throughout the procedure.\n\n3. **Surgical Field Preparation**: The surgical field was properly sterilized and draped to prevent infection. The nasal cavity and lips were disinfected with iodine-containing cotton swabs.\n\n4. **Sphenoid Sinus Opening**: The sphenoid sinus opening was successfully expanded with a microburr, and the ventral wall of the sphenoid sinus was removed.\n\n5. **Sellar Floor Thinning and Cyst Removal**: The sellar floor was thinned, and the cyst was removed using a microscopic curette. The contents of the cyst were sequentially removed, and no residual cyst content was found during endoscopic examination.\n\n6. **Postoperative Care**: The lesion cavity was filled with artificial dura mater, and the sellar floor was reconstructed with instant gauze. The patient's breathing recovered, and they were returned to the anesthesia recovery room with endotracheal intubation.\n\n7. **Pathology Examination**: The specimen was sent to the pathology department for examination.\n\n8. **Postoperative Monitoring**: The patient's vital signs, neurological status, and pain levels were closely monitored to detect any complications early and provide prompt treatment if necessary.\n\n9. **Medication Administration**: Appropriate medications were administered for pain management and to prevent complications, including analgesics, antibiotics, and other medications as deemed necessary by the surgical team.\n\n10. **Follow-up Appointments**: Regular follow-up appointments were scheduled to monitor the patient's recovery and assess for any potential complications. The treatment plan was adjusted based on the patient's progress and response to the surgery.\n\nShortcomings and Suggestions:\n\n1. **Documentation**: The surgical report could be more detailed in describing the specific steps taken during the procedure. For example, the use of a microburr and micro-drilling could be further elaborated upon.\n\n2. **Postoperative Care**: While the patient's vital signs were monitored, it would be beneficial to include specific values or ranges for a more comprehensive report. Additionally, the use of a tracheal intubation during the return to the anesthesia recovery room could be mentioned.\n\n3. **Pathology Examination**: The report could include more information about the pathological findings, such as the type and grade of the tumor, if available.\n\n4. **Medication Administration**: The specific medications administered, including dosages and routes of administration, could be included for a more thorough report.\n\n5. **Follow-up Appointments**: The frequency and duration of the follow-up appointments could be specified to provide a clearer picture of the patient's postoperative care plan.\n\nBy addressing these points, the surgical report would be more comprehensive and informative, providing a better understanding of the surgical process and the patient's postoperative care.",
      "surgery_name": "Neuroendoscopic transnasal sphenoidal sinus sellar region space-occupying lesion resection + sellar floor reconstruction",
      "id": "2",
      "tag":1,
      "MR": "The sellar area is enlarged. The transverse diameter of the pituitary gland is 17.6mm, the height is 11.4mm, and the anteroposterior diameter is 11.2mm. There is a round-shaped T1 slightly high signal and T2 low signal nodule in the posterior part of the pituitary gland, measuring about 8.2×8.9×15.8mm. , the enhanced scan showed no clear enhancement, and the remaining pituitary glands were moderately enhanced. The transverse diameter of the pituitary stalk was 1.8 mm, and the anteroposterior diameter was 2.6 mm. There was no pressure shift of the optic chiasm and no obvious abnormality of the posterior pituitary gland on both sides. T1 signal is unclear. Bilateral maxillary sinus mucosa is thickened. Abnormal signal in the posterior pituitary gland, Rathke's cleft cyst is possible; short T1 signal in the posterior pituitary gland is unclear, please consider clinical practice; bilateral maxillary sinus mucosa is thickened. ",
      "standard_Preoperative diagnosis": "cystic space-occupying lesion in the sellar region",
      "standard_Surgical steps": "After the anesthesia takes effect, the patient lies in a supine position with the head slightly tilted back, and the operating table is positioned with the head high and the feet low. The surgical field is sterilized and draped as usual, and the nasal cavity and lips are disinfected with iodine-containing cotton swabs. Five minutes after epinephrine 1ml cotton pads were used to shrink the middle turbinate, neuroendoscopic exploration was performed first to expose the ventral wall of the sphenoid sinus. The sphenoid sinus opening was expanded with a microburr, and the ventral wall of the sphenoid sinus was removed. The thinning of the sellar floor bone was seen. The bone window of the sellar floor is opened by micro-drilling to 1.5cm After the pathological specimens were obtained with forceps, the contents of the cyst were removed sequentially with a microscopic curette. The cyst was mainly located in the sella. The thinned normal anterior pituitary tissue was seen in the sella. No residual cyst content was found during the endoscopic examination. There was no obvious cerebrospinal fluid leakage in the sella, no obvious active bleeding in the surgical field, and no foreign body residue. The lesion cavity was filled with artificial dura mater, and the sellar floor was reconstructed with instant gauze. One piece of Naxi cotton was filled on the left and right sides of the nasal cavity. The operation was completed. There was little bleeding during the operation and no blood transfusion was performed. After the operation, the patient's breathing recovered and the patient was returned to the anesthesia recovery room with endotracheal intubation. The cyst was removed and the specimen was sent to the pathology department. "
    }
  ]